-- phpMyAdmin SQL Dump
-- version 3.4.10.1deb1
-- http://www.phpmyadmin.net
--
-- Host: localhost
-- Generation Time: May 27, 2013 at 03:06 PM
-- Server version: 5.5.31
-- PHP Version: 5.3.10-1ubuntu3.6

SET SQL_MODE="NO_AUTO_VALUE_ON_ZERO";
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8 */;

--
-- Database: `cms`
--

-- --------------------------------------------------------

--
-- Table structure for table `articles`
--

CREATE TABLE IF NOT EXISTS `articles` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `title` text,
  `description` text,
  `header` text,
  `content` text,
  `id_category` int(11) DEFAULT NULL,
  `updated_at` date DEFAULT NULL,
  `created_at` date DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB  DEFAULT CHARSET=utf8 AUTO_INCREMENT=41 ;

--
-- Dumping data for table `articles`
--

INSERT INTO `articles` (`id`, `title`, `description`, `header`, `content`, `id_category`, `updated_at`, `created_at`) VALUES
(1, '22', '335', '112', '<p>44</p>\n', 21, '2013-05-23', '2013-05-21'),
(2, 'title для этой статьи', 'Красивое и сочное описание', 'Заголовок статьи', '<p>контентконтентконтент</p>\n\n<p>&nbsp;</p>\n\n<p>&nbsp;</p>\n\n<p>&nbsp;</p>\n\n<p>контентммконтентконтент</p>\n\n<p>контентконтентконтент</p>\n\n<p>&nbsp;</p>\n\n<p>&nbsp;</p>\n\n<p>&nbsp;</p>\n\n<p>контентммконтентконтент</p>\n\n<p>контентконтентконтент</p>\n\n<p>&nbsp;</p>\n\n<p>&nbsp;</p>\n\n<p>&nbsp;</p>\n\n<p>контентммконтентконтент</p>\n\n<p>контентконтентконтент</p>\n\n<p>&nbsp;</p>\n\n<p>&nbsp;</p>\n\n<p>&nbsp;</p>\n\n<p>контентммконтентконтент</p>\n', 32, '2013-05-21', '2013-05-21'),
(3, '', '', 's', '<p>3</p>\n', 0, '2013-05-21', '2013-05-21'),
(4, 'd', '', 's', '<p>3</p>\n', 21, '2013-05-21', '2013-05-21'),
(5, 'd', '', 's', '<p>3</p>\n', 21, '2013-05-21', '2013-05-21'),
(6, 'd', '', 's', '<p>3</p>\n', 21, '2013-05-21', '2013-05-21'),
(7, 'd', '', 's', '<p>3</p>\n', 21, '2013-05-21', '2013-05-21'),
(8, 'sdf', 'sdf', 'asd', '<p>3sdf</p>\n', 0, '2013-05-21', '2013-05-21'),
(9, 'asdf', 'sadf', 'asdf', '<p>3asdf</p>\n', 0, '2013-05-21', '2013-05-21'),
(10, 'asdf', 'sadf', 'asdf', '<p>3asdf</p>\n', 0, '2013-05-21', '2013-05-21'),
(11, '2', '3', '1', '<p>4</p>\n', 21, '2013-05-22', '2013-05-22'),
(12, '2', '3', '1', '<p>4</p>\n', 21, '2013-05-22', '2013-05-22'),
(13, '2', '3', '1', '<p>4</p>\n', 21, '2013-05-22', '2013-05-22'),
(14, '2', '3', '1', '<p>4</p>\n', 21, '2013-05-22', '2013-05-22'),
(15, '2', '3', '1', '<p>4</p>\n', 21, '2013-05-22', '2013-05-22'),
(16, '2', '3', '1', '<p>4</p>\n', 21, '2013-05-22', '2013-05-22'),
(17, '2', '3', '1', '<p>4</p>\n', 21, '2013-05-22', '2013-05-22'),
(18, '', '', '1', '', 0, '2013-05-22', '2013-05-22'),
(19, '', '', '1', '', 28, '2013-05-22', '2013-05-22'),
(20, '', '', '1', '', 28, '2013-05-22', '2013-05-22'),
(21, '', '', '1', '<p>1</p>\n', 31, '2013-05-22', '2013-05-22'),
(22, '', '', '1', '<p>1</p>\n', 31, '2013-05-22', '2013-05-22'),
(23, '', '', '1', '<p>1</p>\n', 31, '2013-05-22', '2013-05-22'),
(24, 'asdf', 'asdf', 'asdf', '<p>asdf</p>\n', 0, '2013-05-22', '2013-05-22'),
(25, '2', '3', '1', '<p>4</p>\n', 0, '2013-05-22', '2013-05-22'),
(26, '', '', 'a', '', 0, '2013-05-22', '2013-05-22'),
(27, '', '', 's', '', 0, '2013-05-22', '2013-05-22'),
(28, '', '', 's', '', 0, '2013-05-22', '2013-05-22'),
(29, '', '', 's', '', 0, '2013-05-22', '2013-05-22'),
(30, '', '', 'd', '', 0, '2013-05-22', '2013-05-22'),
(31, '', '', 'ddd', '', 0, '2013-05-22', '2013-05-22'),
(32, '', '', 's', '', 0, '2013-05-22', '2013-05-22'),
(33, '', '', 'd', '', 0, '2013-05-22', '2013-05-22'),
(34, '', '', 's', '<p>s</p>\n', 0, '2013-05-22', '2013-05-22'),
(35, '', '', 'asdf', '<p>s</p>\n', 0, '2013-05-22', '2013-05-22'),
(36, '', '', 'sdf', '<p>s</p>\n', 0, '2013-05-22', '2013-05-22'),
(37, '', '', 'sdf', '<p>sfd</p>\n', 0, '2013-05-22', '2013-05-22'),
(38, '', '', 'asdf', '', 0, '2013-05-22', '2013-05-22'),
(39, '', '', 's', '', 0, '2013-05-22', '2013-05-22'),
(40, '2', '3', '1', '<p>4</p>\n', 28, '2013-05-23', '2013-05-23');

-- --------------------------------------------------------

--
-- Table structure for table `categories`
--

CREATE TABLE IF NOT EXISTS `categories` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `parent_id` int(11) DEFAULT NULL,
  `name_category` text,
  `updated_at` date NOT NULL,
  `created_at` date NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB  DEFAULT CHARSET=utf8 AUTO_INCREMENT=36 ;

--
-- Dumping data for table `categories`
--

INSERT INTO `categories` (`id`, `parent_id`, `name_category`, `updated_at`, `created_at`) VALUES
(21, NULL, 'Категория', '2013-05-08', '2013-05-08'),
(22, NULL, 'Категория 2', '2013-05-08', '2013-05-08'),
(23, NULL, 'Еще одна категория', '2013-05-13', '2013-05-08'),
(28, 21, 'Подкатегория', '2013-05-08', '2013-05-08'),
(30, 21, 'Еще одна подкатегория', '2013-05-08', '2013-05-08'),
(31, 21, 'И еще одна подкатегория', '2013-05-08', '2013-05-08'),
(32, 31, 'Второй уровень вложенности', '2013-05-08', '2013-05-08'),
(34, 23, 'Ля ля ля1', '2013-05-13', '2013-05-13'),
(35, 23, 'Ля ля ля', '2013-05-13', '2013-05-13');

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
