<?php 

class Albums extends Eloquent {

	public static $table = 'albums';

	//----------------------------------------------------------------------------------------------------------------------
	// Получить все альбомы ввиде массива
	//----------------------------------------------------------------------------------------------------------------------
	public static function getAlbums() {
		$albums_arr = array();
		$albums = Albums::all();
		foreach ($albums as $album) {
			$albums_arr[] = $album->to_array();
		}

		return $albums_arr;
	}
/*
	//----------------------------------------------------------------------------------------------------------------------
	// Получить данные альбопа по Id
	//----------------------------------------------------------------------------------------------------------------------
	public static function getAlbumById($idAlbum) {

	}
*/
}

?>
